;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
;* Date/Time created: Mon Apr 14 16:50:30 2025                 *
;***************************************************************
	.compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_errata_fpu1_workaround=on --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("E:\GiaotrinhDH\DATN\exampleSixStep\mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw\CCS_Project\Debug")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_MW_adcInitFlag+0,32
	.bits		0,16
			; _MW_adcInitFlag @ 0


$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("InitAdc")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_InitAdc")

        IRET      ; [CPU_ALU] 
        ; return occurs ; [] 
	.dwattr $C$DW$102, DW_AT_TI_end_file("E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c")
	.dwattr $C$DW$102, DW_AT_TI_end_line(0x688)
	.dwattr $C$DW$102, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$102

	.sect	".text"
	.clink
	.global	_mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts

$C$DW$116	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$116, DW_AT_name("mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts")
	.dwattr $C$DW$116, DW_AT_low_pc(_mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts)
	.dwattr $C$DW$116, DW_AT_high_pc(0x00)
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("_mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts")
	.dwattr $C$DW$116, DW_AT_external
	.dwattr $C$DW$116, DW_AT_TI_begin_file("E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c")
	.dwattr $C$DW$116, DW_AT_TI_begin_line(0x68a)
	.dwattr $C$DW$116, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$116, DW_AT_TI_max_frame_size(-2)
	.dwpsn	file "E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c",line 1675,column 1,is_stmt,address _mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts,isa 0

	.dwfde $C$DW$CIE, _mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts
;----------------------------------------------------------------------
; 1674 | void mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts
;     | (void)                                                                 
;----------------------------------------------------------------------

;***************************************************************
;* FNAME: _mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Parameter,  0 Auto,  0 SOE     *
;***************************************************************

_mcb_bldc_sixstep_f28069mLaunchPad_openLoop_unconfigure_interrupts:
	.dwcfi	cfa_offset, -2
	.dwcfi	save_reg_to_mem, 26, 0
	.dwpsn	file "E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c",line 1676,column 3,is_stmt,isa 0
;----------------------------------------------------------------------
; 1676 | HWI_TIC28x_DisableIRQ(32);                                             
;----------------------------------------------------------------------
        MOVB      AL,#32                ; [CPU_ALU] |1676| 
$C$DW$117	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$117, DW_AT_low_pc(0x00)
	.dwattr $C$DW$117, DW_AT_name("_HWI_TIC28x_DisableIRQ")
	.dwattr $C$DW$117, DW_AT_TI_call

        LCR       #_HWI_TIC28x_DisableIRQ ; [CPU_ALU] |1676| 
        ; call occurs [#_HWI_TIC28x_DisableIRQ] ; [] |1676| 
	.dwpsn	file "E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c",line 1677,column 3,is_stmt,isa 0
;----------------------------------------------------------------------
; 1677 | HWI_TIC28x_DisableIRQ(96);                                             
;----------------------------------------------------------------------
        MOVB      AL,#96                ; [CPU_ALU] |1677| 
$C$DW$118	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$118, DW_AT_low_pc(0x00)
	.dwattr $C$DW$118, DW_AT_name("_HWI_TIC28x_DisableIRQ")
	.dwattr $C$DW$118, DW_AT_TI_call

        LCR       #_HWI_TIC28x_DisableIRQ ; [CPU_ALU] |1677| 
        ; call occurs [#_HWI_TIC28x_DisableIRQ] ; [] |1677| 
	.dwpsn	file "E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c",line 1678,column 1,is_stmt,isa 0
$C$DW$119	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$119, DW_AT_low_pc(0x00)
	.dwattr $C$DW$119, DW_AT_TI_return

        LRETR     ; [CPU_ALU] 
        ; return occurs ; [] 
	.dwattr $C$DW$116, DW_AT_TI_end_file("E:/GiaotrinhDH/DATN/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_openLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_openLoop.c")
	.dwattr $C$DW$116, DW_AT_TI_end_line(0x68e)
	.dwattr $C$DW$116, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$116

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_InitAdc
	.global	_config_ADC_SOC1
	.global	_config_QEP_eQEP1
	.global	_config_ADC_SOC0
	.global	_HWI_TIC28x_ConfigureIRQ
	.global	_HWI_TIC28x_EnableIRQ
	.global	_HWI_TIC28x_AcknowledgeIrq
	.global	_HWI_TIC28x_DisableIRQ
	.global	_checkSCITransmitInProgressA
	.global	_mcb_bldc_sixstep_f28069m_ConstB
	.global	_runModel
	.global	_scia_xmit
	.global	_scia_rcv
	.global	_memset
	.global	_floor
	.global	_ldexp
	.global	_CpuTimer2Regs
	.global	_AdcResult
	.global	_SciaRegs
	.global	_GpioDataRegs
	.global	_EQep1Regs
	.global	_mcb_bldc_sixstep_f28069m_ConstP
	.global	_EPwm1Regs
	.global	_EPwm2Regs
	.global	_EPwm3Regs
	.global	_GpioCtrlRegs
	.global	_AdcRegs
	.global	_memcpy

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$120, DW_AT_name("Width")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("_Width")
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$21

$C$DW$T$229	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$229, DW_AT_name("ConstBlockIO_mcb_bldc_sixstep_f")
	.dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$229, DW_AT_language(DW_LANG_C)

$C$DW$121	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$229)

$C$DW$T$230	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$230, DW_AT_type(*$C$DW$121)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x30)
$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$122, DW_AT_name("pooled7")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("_pooled7")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$123, DW_AT_name("pooled8")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("_pooled8")
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$124, DW_AT_name("pooled9")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("_pooled9")
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$125, DW_AT_name("pooled10")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("_pooled10")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$126, DW_AT_name("pooled11")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("_pooled11")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$127, DW_AT_name("pooled12")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("_pooled12")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$24

$C$DW$T$231	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$231, DW_AT_name("ConstParam_mcb_bldc_sixstep_f28")
	.dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)

$C$DW$128	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$231)

$C$DW$T$232	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$232, DW_AT_type(*$C$DW$128)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x98)
$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$129, DW_AT_name("Merge")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("_Merge")
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$130, DW_AT_name("Sign")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("_Sign")
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$131, DW_AT_name("Add")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("_Add")
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$132, DW_AT_name("Q17perunitconversion")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("_Q17perunitconversion")
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$133, DW_AT_name("PositionToCount")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("_PositionToCount")
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$134, DW_AT_name("Delay")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("_Delay")
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$135, DW_AT_name("Gain")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("_Gain")
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$136, DW_AT_name("Pot_limit")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("_Pot_limit")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$137, DW_AT_name("duty")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("_duty")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$138, DW_AT_name("DataTypeConversion1")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("_DataTypeConversion1")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$139, DW_AT_name("DataTypeConversion")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("_DataTypeConversion")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$140, DW_AT_name("DataTypeConversion2")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("_DataTypeConversion2")
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$141, DW_AT_name("DataTypeConversion1_e")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("_DataTypeConversion1_e")
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$142, DW_AT_name("DTC")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("_DTC")
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$143, DW_AT_name("Product")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("_Product")
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$144, DW_AT_name("DTC_m")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("_DTC_m")
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$145, DW_AT_name("SpeedGain")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("_SpeedGain")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$146, DW_AT_name("Product_c")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("_Product_c")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$147, DW_AT_name("UnitDelay")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("_UnitDelay")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$148, DW_AT_name("Product1")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("_Product1")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$149, DW_AT_name("Add1")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("_Add1")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$150, DW_AT_name("Switch")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$151, DW_AT_name("Merge_m")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("_Merge_m")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$152, DW_AT_name("Numberofpolepairs")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("_Numberofpolepairs")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$153, DW_AT_name("Floor")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("_Floor")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$154, DW_AT_name("Add_h")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("_Add_h")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$155, DW_AT_name("DataTypeConversion3")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("_DataTypeConversion3")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$156, DW_AT_name("DataTypeConversion1_p")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("_DataTypeConversion1_p")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$157, DW_AT_name("SpeedCount")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("_SpeedCount")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$158, DW_AT_name("SCIReceive")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("_SCIReceive")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$159, DW_AT_name("ReadPOT")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("_ReadPOT")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$160, DW_AT_name("eQEP_o1")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("_eQEP_o1")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x53]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$161, DW_AT_name("eQEP_o2")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("_eQEP_o2")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$162, DW_AT_name("Switch1")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("_Switch1")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$163, DW_AT_name("Idc_Measurement")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("_Idc_Measurement")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$164, DW_AT_name("Output")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("_Output")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$165, DW_AT_name("DataTypeConversion1_d")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("_DataTypeConversion1_d")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$166, DW_AT_name("SCI_Tx_Data")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("_SCI_Tx_Data")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$167, DW_AT_name("SCI_Tx_Iteration")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("_SCI_Tx_Iteration")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$168, DW_AT_name("FixPtSum1")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("_FixPtSum1")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$169, DW_AT_name("FixPtSwitch")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("_FixPtSwitch")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$170, DW_AT_name("IndexVector")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("_IndexVector")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x67]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$171, DW_AT_name("Add_n")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("_Add_n")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$172, DW_AT_name("Scale_to_PWM_Counter_PRD")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("_Scale_to_PWM_Counter_PRD")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$173, DW_AT_name("Merge_k")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("_Merge_k")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6f]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$174, DW_AT_name("Sum3")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("_Sum3")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$175, DW_AT_name("Sum7")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_Sum7")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$176, DW_AT_name("Data")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_Data")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$177, DW_AT_name("Data_f")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_Data_f")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$178, DW_AT_name("Data_fw")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("_Data_fw")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$179, DW_AT_name("DataTypeConversion2_i")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("_DataTypeConversion2_i")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x7b]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$180, DW_AT_name("DataTypeConversion_l")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_DataTypeConversion_l")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$181, DW_AT_name("WhileIterator")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_WhileIterator")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$182, DW_AT_name("Merge_j")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_Merge_j")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x81]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$183, DW_AT_name("ShiftArithmetic")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_ShiftArithmetic")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$184, DW_AT_name("A")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_A")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x83]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$185, DW_AT_name("ShiftArithmetic1")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_ShiftArithmetic1")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$186, DW_AT_name("B")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_B")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x85]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$187, DW_AT_name("C")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_C")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$188, DW_AT_name("DataTypeConversion4")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_DataTypeConversion4")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$189, DW_AT_name("DataTypeConversion3_h")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_DataTypeConversion3_h")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$190, DW_AT_name("Enable")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("_Enable")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x89]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$191, DW_AT_name("DataStoreRead")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("_DataStoreRead")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$192, DW_AT_name("Merge_f")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("_Merge_f")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8b]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$193, DW_AT_name("Merge_n")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("_Merge_n")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$194, DW_AT_name("DataTypeConversion_i")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("_DataTypeConversion_i")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$195, DW_AT_name("DataTypeConversion1_k")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("_DataTypeConversion1_k")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x95]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$196, DW_AT_name("DataTypeConversion2_e")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("_DataTypeConversion2_e")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$41

$C$DW$T$233	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$233, DW_AT_name("BlockIO_mcb_bldc_sixstep_f28069")
	.dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x3e)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$197, DW_AT_name("IaOffset")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("_IaOffset")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$198, DW_AT_name("IbOffset")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("_IbOffset")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$199, DW_AT_name("IcOffset")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("_IcOffset")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$200, DW_AT_name("Add_DWORK1")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_Add_DWORK1")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$201, DW_AT_name("UnitDelay_DSTATE")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_UnitDelay_DSTATE")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$202, DW_AT_name("Delay_DSTATE")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_Delay_DSTATE")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$203, DW_AT_name("DigitalOutput_FRAC_LEN")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_DigitalOutput_FRAC_LEN")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$204, DW_AT_name("DigitalOutput_FRAC_LEN_o")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_DigitalOutput_FRAC_LEN_o")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$205, DW_AT_name("SpeedCount_DWORK1")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_SpeedCount_DWORK1")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$206, DW_AT_name("Output_DSTATE")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_Output_DSTATE")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$207, DW_AT_name("Add_DWORK1_o")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_Add_DWORK1_o")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$208, DW_AT_name("CircBufIdx")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_CircBufIdx")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$209, DW_AT_name("MotorDirection")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_MotorDirection")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$210, DW_AT_name("MotorEnable")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_MotorEnable")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$43

$C$DW$T$235	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$235, DW_AT_name("D_Work_mcb_bldc_sixstep_f28069m")
	.dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_name("ADCCTL1_BITS")
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$211, DW_AT_name("TEMPCONV")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("_TEMPCONV")
	.dwattr $C$DW$211, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$211, DW_AT_bit_size(0x01)
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$212, DW_AT_name("VREFLOCONV")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("_VREFLOCONV")
	.dwattr $C$DW$212, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$212, DW_AT_bit_size(0x01)
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$213, DW_AT_name("INTPULSEPOS")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTPULSEPOS")
	.dwattr $C$DW$213, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$213, DW_AT_bit_size(0x01)
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$214, DW_AT_name("ADCREFSEL")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("_ADCREFSEL")
	.dwattr $C$DW$214, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$214, DW_AT_bit_size(0x01)
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$215, DW_AT_name("rsvd1")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$215, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$215, DW_AT_bit_size(0x01)
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$216, DW_AT_name("ADCREFPWD")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("_ADCREFPWD")
	.dwattr $C$DW$216, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$216, DW_AT_bit_size(0x01)
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$217, DW_AT_name("ADCBGPWD")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("_ADCBGPWD")
	.dwattr $C$DW$217, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$217, DW_AT_bit_size(0x01)
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$218, DW_AT_name("ADCPWDN")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_ADCPWDN")
	.dwattr $C$DW$218, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$218, DW_AT_bit_size(0x01)
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$219, DW_AT_name("ADCBSYCHN")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_ADCBSYCHN")
	.dwattr $C$DW$219, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$219, DW_AT_bit_size(0x05)
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$220, DW_AT_name("ADCBSY")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_ADCBSY")
	.dwattr $C$DW$220, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$220, DW_AT_bit_size(0x01)
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$221, DW_AT_name("ADCENABLE")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_ADCENABLE")
	.dwattr $C$DW$221, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$221, DW_AT_bit_size(0x01)
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$222, DW_AT_name("RESET")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_RESET")
	.dwattr $C$DW$222, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$222, DW_AT_bit_size(0x01)
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$45


$C$DW$T$46	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$46, DW_AT_name("ADCCTL1_REG")
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$223, DW_AT_name("all")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$224, DW_AT_name("bit")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$46


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_name("ADCCTL2_BITS")
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$225, DW_AT_name("CLKDIV2EN")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_CLKDIV2EN")
	.dwattr $C$DW$225, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$225, DW_AT_bit_size(0x01)
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$226, DW_AT_name("ADCNONOVERLAP")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
	.dwattr $C$DW$226, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$226, DW_AT_bit_size(0x01)
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$227, DW_AT_name("CLKDIV4EN")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_CLKDIV4EN")
	.dwattr $C$DW$227, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$227, DW_AT_bit_size(0x01)
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$228, DW_AT_name("rsvd1")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$228, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$228, DW_AT_bit_size(0x0d)
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$47


$C$DW$T$48	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$48, DW_AT_name("ADCCTL2_REG")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$229, DW_AT_name("all")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$230, DW_AT_name("bit")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$48


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_name("ADCINTSOCSEL1_BITS")
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$231, DW_AT_name("SOC0")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_SOC0")
	.dwattr $C$DW$231, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$231, DW_AT_bit_size(0x02)
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$232, DW_AT_name("SOC1")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_SOC1")
	.dwattr $C$DW$232, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$232, DW_AT_bit_size(0x02)
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$233, DW_AT_name("SOC2")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_SOC2")
	.dwattr $C$DW$233, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$233, DW_AT_bit_size(0x02)
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$234, DW_AT_name("SOC3")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_SOC3")
	.dwattr $C$DW$234, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$234, DW_AT_bit_size(0x02)
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$235, DW_AT_name("SOC4")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_SOC4")
	.dwattr $C$DW$235, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$235, DW_AT_bit_size(0x02)
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$236, DW_AT_name("SOC5")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_SOC5")
	.dwattr $C$DW$236, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$236, DW_AT_bit_size(0x02)
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$237, DW_AT_name("SOC6")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_SOC6")
	.dwattr $C$DW$237, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$237, DW_AT_bit_size(0x02)
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$238, DW_AT_name("SOC7")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_SOC7")
	.dwattr $C$DW$238, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$238, DW_AT_bit_size(0x02)
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$49


$C$DW$T$50	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$50, DW_AT_name("ADCINTSOCSEL1_REG")
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$239, DW_AT_name("all")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$240, DW_AT_name("bit")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$50


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_name("ADCINTSOCSEL2_BITS")
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$241, DW_AT_name("SOC8")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_SOC8")
	.dwattr $C$DW$241, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$241, DW_AT_bit_size(0x02)
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$242, DW_AT_name("SOC9")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_SOC9")
	.dwattr $C$DW$242, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$242, DW_AT_bit_size(0x02)
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$243, DW_AT_name("SOC10")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_SOC10")
	.dwattr $C$DW$243, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$243, DW_AT_bit_size(0x02)
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$244, DW_AT_name("SOC11")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_SOC11")
	.dwattr $C$DW$244, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$244, DW_AT_bit_size(0x02)
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$245, DW_AT_name("SOC12")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_SOC12")
	.dwattr $C$DW$245, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$245, DW_AT_bit_size(0x02)
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$246, DW_AT_name("SOC13")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_SOC13")
	.dwattr $C$DW$246, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$246, DW_AT_bit_size(0x02)
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$247, DW_AT_name("SOC14")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_SOC14")
	.dwattr $C$DW$247, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$247, DW_AT_bit_size(0x02)
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$248, DW_AT_name("SOC15")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_SOC15")
	.dwattr $C$DW$248, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$248, DW_AT_bit_size(0x02)
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$51


$C$DW$T$52	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$52, DW_AT_name("ADCINTSOCSEL2_REG")
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$249, DW_AT_name("all")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$250, DW_AT_name("bit")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$52


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_name("ADCINT_BITS")
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$251, DW_AT_name("ADCINT1")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_ADCINT1")
	.dwattr $C$DW$251, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$251, DW_AT_bit_size(0x01)
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$252, DW_AT_name("ADCINT2")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_ADCINT2")
	.dwattr $C$DW$252, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$252, DW_AT_bit_size(0x01)
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$253, DW_AT_name("ADCINT3")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_ADCINT3")
	.dwattr $C$DW$253, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$253, DW_AT_bit_size(0x01)
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$254, DW_AT_name("ADCINT4")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_ADCINT4")
	.dwattr $C$DW$254, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$254, DW_AT_bit_size(0x01)
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$255, DW_AT_name("ADCINT5")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_ADCINT5")
	.dwattr $C$DW$255, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$255, DW_AT_bit_size(0x01)
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$256, DW_AT_name("ADCINT6")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_ADCINT6")
	.dwattr $C$DW$256, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$256, DW_AT_bit_size(0x01)
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$257, DW_AT_name("ADCINT7")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_ADCINT7")
	.dwattr $C$DW$257, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$257, DW_AT_bit_size(0x01)
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$258, DW_AT_name("ADCINT8")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_ADCINT8")
	.dwattr $C$DW$258, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$258, DW_AT_bit_size(0x01)
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$259, DW_AT_name("ADCINT9")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_ADCINT9")
	.dwattr $C$DW$259, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$259, DW_AT_bit_size(0x01)
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$260, DW_AT_name("rsvd1")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$260, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$260, DW_AT_bit_size(0x07)
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$53


$C$DW$T$54	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$54, DW_AT_name("ADCINT_REG")
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$261, DW_AT_name("all")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$262, DW_AT_name("bit")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$54


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_name("ADCOFFTRIM_BITS")
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$263, DW_AT_name("OFFTRIM")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_OFFTRIM")
	.dwattr $C$DW$263, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$263, DW_AT_bit_size(0x09)
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$264, DW_AT_name("rsvd1")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$264, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$264, DW_AT_bit_size(0x07)
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$56


$C$DW$T$57	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$57, DW_AT_name("ADCOFFTRIM_REG")
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$265, DW_AT_name("all")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$266, DW_AT_name("bit")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$57


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_name("ADCREFTRIM_BITS")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$267, DW_AT_name("BG_FINE_TRIM")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
	.dwattr $C$DW$267, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$267, DW_AT_bit_size(0x05)
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$268, DW_AT_name("BG_COARSE_TRIM")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
	.dwattr $C$DW$268, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$268, DW_AT_bit_size(0x04)
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$269, DW_AT_name("EXTREF_FINE_TRIM")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
	.dwattr $C$DW$269, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$269, DW_AT_bit_size(0x05)
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$270, DW_AT_name("rsvd1")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$270, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$270, DW_AT_bit_size(0x02)
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$58


$C$DW$T$59	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$59, DW_AT_name("ADCREFTRIM_REG")
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$271, DW_AT_name("all")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$272, DW_AT_name("bit")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$59


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_name("ADCSAMPLEMODE_BITS")
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$273, DW_AT_name("SIMULEN0")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_SIMULEN0")
	.dwattr $C$DW$273, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$273, DW_AT_bit_size(0x01)
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$274, DW_AT_name("SIMULEN2")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_SIMULEN2")
	.dwattr $C$DW$274, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$274, DW_AT_bit_size(0x01)
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$275, DW_AT_name("SIMULEN4")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_SIMULEN4")
	.dwattr $C$DW$275, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$275, DW_AT_bit_size(0x01)
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$276, DW_AT_name("SIMULEN6")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_SIMULEN6")
	.dwattr $C$DW$276, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$276, DW_AT_bit_size(0x01)
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$277, DW_AT_name("SIMULEN8")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_SIMULEN8")
	.dwattr $C$DW$277, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$277, DW_AT_bit_size(0x01)
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$278, DW_AT_name("SIMULEN10")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_SIMULEN10")
	.dwattr $C$DW$278, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$278, DW_AT_bit_size(0x01)
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$279, DW_AT_name("SIMULEN12")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_SIMULEN12")
	.dwattr $C$DW$279, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$279, DW_AT_bit_size(0x01)
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$280, DW_AT_name("SIMULEN14")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_SIMULEN14")
	.dwattr $C$DW$280, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$280, DW_AT_bit_size(0x01)
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$281, DW_AT_name("rsvd1")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$281, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$281, DW_AT_bit_size(0x08)
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$60


$C$DW$T$61	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$61, DW_AT_name("ADCSAMPLEMODE_REG")
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$282, DW_AT_name("all")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$283, DW_AT_name("bit")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$61


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_name("ADCSOC_BITS")
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$284, DW_AT_name("SOC0")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_SOC0")
	.dwattr $C$DW$284, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$284, DW_AT_bit_size(0x01)
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$285, DW_AT_name("SOC1")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_SOC1")
	.dwattr $C$DW$285, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$285, DW_AT_bit_size(0x01)
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$286, DW_AT_name("SOC2")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_SOC2")
	.dwattr $C$DW$286, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$286, DW_AT_bit_size(0x01)
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$287, DW_AT_name("SOC3")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_SOC3")
	.dwattr $C$DW$287, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$287, DW_AT_bit_size(0x01)
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$288, DW_AT_name("SOC4")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_SOC4")
	.dwattr $C$DW$288, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$288, DW_AT_bit_size(0x01)
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$289, DW_AT_name("SOC5")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_SOC5")
	.dwattr $C$DW$289, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$289, DW_AT_bit_size(0x01)
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$290, DW_AT_name("SOC6")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_SOC6")
	.dwattr $C$DW$290, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$290, DW_AT_bit_size(0x01)
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$291, DW_AT_name("SOC7")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_SOC7")
	.dwattr $C$DW$291, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$291, DW_AT_bit_size(0x01)
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$292, DW_AT_name("SOC8")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_SOC8")
	.dwattr $C$DW$292, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$292, DW_AT_bit_size(0x01)
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$293, DW_AT_name("SOC9")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_SOC9")
	.dwattr $C$DW$293, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$293, DW_AT_bit_size(0x01)
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$294, DW_AT_name("SOC10")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_SOC10")
	.dwattr $C$DW$294, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$294, DW_AT_bit_size(0x01)
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$295, DW_AT_name("SOC11")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_SOC11")
	.dwattr $C$DW$295, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$295, DW_AT_bit_size(0x01)
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$296, DW_AT_name("SOC12")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_SOC12")
	.dwattr $C$DW$296, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$296, DW_AT_bit_size(0x01)
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$297, DW_AT_name("SOC13")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_SOC13")
	.dwattr $C$DW$297, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$297, DW_AT_bit_size(0x01)
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$298, DW_AT_name("SOC14")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_SOC14")
	.dwattr $C$DW$298, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$298, DW_AT_bit_size(0x01)
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$299, DW_AT_name("SOC15")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_SOC15")
	.dwattr $C$DW$299, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$299, DW_AT_bit_size(0x01)
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$62


$C$DW$T$63	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$63, DW_AT_name("ADCSOC_REG")
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$300, DW_AT_name("all")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$301, DW_AT_name("bit")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$63


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_name("ADCSOCxCTL_BITS")
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$302, DW_AT_name("ACQPS")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_ACQPS")
	.dwattr $C$DW$302, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$302, DW_AT_bit_size(0x06)
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$303, DW_AT_name("CHSEL")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_CHSEL")
	.dwattr $C$DW$303, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$303, DW_AT_bit_size(0x04)
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$304, DW_AT_name("rsvd1")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$304, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$304, DW_AT_bit_size(0x01)
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$305, DW_AT_name("TRIGSEL")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_TRIGSEL")
	.dwattr $C$DW$305, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$305, DW_AT_bit_size(0x05)
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$64


$C$DW$T$65	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$65, DW_AT_name("ADCSOCxCTL_REG")
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$306, DW_AT_name("all")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$307, DW_AT_name("bit")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$65


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_name("ADC_REGS")
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x50)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$308, DW_AT_name("ADCCTL1")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_ADCCTL1")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$309, DW_AT_name("ADCCTL2")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_ADCCTL2")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$310, DW_AT_name("rsvd1")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$311, DW_AT_name("rsvd2")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$312, DW_AT_name("ADCINTFLG")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_ADCINTFLG")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$313, DW_AT_name("ADCINTFLGCLR")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$314, DW_AT_name("ADCINTOVF")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_ADCINTOVF")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$315, DW_AT_name("ADCINTOVFCLR")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$316, DW_AT_name("INTSEL1N2")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_INTSEL1N2")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$317, DW_AT_name("INTSEL3N4")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_INTSEL3N4")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$318, DW_AT_name("INTSEL5N6")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_INTSEL5N6")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$319, DW_AT_name("INTSEL7N8")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_INTSEL7N8")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$320, DW_AT_name("INTSEL9N10")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_INTSEL9N10")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$321, DW_AT_name("rsvd3")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$322, DW_AT_name("rsvd4")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$323, DW_AT_name("rsvd5")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_rsvd5")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$324, DW_AT_name("SOCPRICTL")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_SOCPRICTL")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$325, DW_AT_name("rsvd6")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_rsvd6")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$326, DW_AT_name("ADCSAMPLEMODE")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$327, DW_AT_name("rsvd7")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_rsvd7")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$328, DW_AT_name("ADCINTSOCSEL1")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$329, DW_AT_name("ADCINTSOCSEL2")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$330, DW_AT_name("rsvd8")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_rsvd8")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$331, DW_AT_name("rsvd9")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_rsvd9")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$332, DW_AT_name("ADCSOCFLG1")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_ADCSOCFLG1")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$333, DW_AT_name("rsvd10")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_rsvd10")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$334, DW_AT_name("ADCSOCFRC1")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_ADCSOCFRC1")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$335, DW_AT_name("rsvd11")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_rsvd11")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$336, DW_AT_name("ADCSOCOVF1")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_ADCSOCOVF1")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$337, DW_AT_name("rsvd12")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_rsvd12")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$338, DW_AT_name("ADCSOCOVFCLR1")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$339, DW_AT_name("rsvd13")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_rsvd13")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$340, DW_AT_name("ADCSOC0CTL")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_ADCSOC0CTL")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$341, DW_AT_name("ADCSOC1CTL")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_ADCSOC1CTL")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$342, DW_AT_name("ADCSOC2CTL")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_ADCSOC2CTL")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$343, DW_AT_name("ADCSOC3CTL")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_ADCSOC3CTL")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$344, DW_AT_name("ADCSOC4CTL")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_ADCSOC4CTL")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$345, DW_AT_name("ADCSOC5CTL")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_ADCSOC5CTL")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$346, DW_AT_name("ADCSOC6CTL")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_ADCSOC6CTL")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$347, DW_AT_name("ADCSOC7CTL")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_ADCSOC7CTL")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$348, DW_AT_name("ADCSOC8CTL")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_ADCSOC8CTL")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$349, DW_AT_name("ADCSOC9CTL")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_ADCSOC9CTL")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$350, DW_AT_name("ADCSOC10CTL")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_ADCSOC10CTL")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$351, DW_AT_name("ADCSOC11CTL")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_ADCSOC11CTL")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$352, DW_AT_name("ADCSOC12CTL")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_ADCSOC12CTL")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$353, DW_AT_name("ADCSOC13CTL")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_ADCSOC13CTL")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$354, DW_AT_name("ADCSOC14CTL")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_ADCSOC14CTL")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$355, DW_AT_name("ADCSOC15CTL")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_ADCSOC15CTL")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$356, DW_AT_name("rsvd14")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_rsvd14")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$357, DW_AT_name("ADCREFTRIM")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_ADCREFTRIM")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$358, DW_AT_name("ADCOFFTRIM")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_ADCOFFTRIM")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$359, DW_AT_name("rsvd15")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_rsvd15")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$360, DW_AT_name("COMPHYSTCTL")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_COMPHYSTCTL")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$361, DW_AT_name("rsvd16")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_rsvd16")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$69

$C$DW$362	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$69)

$C$DW$T$239	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$239, DW_AT_type(*$C$DW$362)


$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_name("ADC_RESULT_REGS")
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x10)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$363, DW_AT_name("ADCRESULT0")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_ADCRESULT0")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$364, DW_AT_name("ADCRESULT1")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_ADCRESULT1")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$365, DW_AT_name("ADCRESULT2")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_ADCRESULT2")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$366, DW_AT_name("ADCRESULT3")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCRESULT3")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$367, DW_AT_name("ADCRESULT4")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_ADCRESULT4")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$368, DW_AT_name("ADCRESULT5")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCRESULT5")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$369, DW_AT_name("ADCRESULT6")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCRESULT6")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$370, DW_AT_name("ADCRESULT7")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCRESULT7")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$371, DW_AT_name("ADCRESULT8")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCRESULT8")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$372, DW_AT_name("ADCRESULT9")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_ADCRESULT9")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$373, DW_AT_name("ADCRESULT10")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_ADCRESULT10")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$374, DW_AT_name("ADCRESULT11")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCRESULT11")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$375, DW_AT_name("ADCRESULT12")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_ADCRESULT12")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$376, DW_AT_name("ADCRESULT13")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCRESULT13")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$377, DW_AT_name("ADCRESULT14")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCRESULT14")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$378, DW_AT_name("ADCRESULT15")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCRESULT15")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$70

$C$DW$379	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$70)

$C$DW$T$240	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$240, DW_AT_type(*$C$DW$379)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_name("AIODAT_BITS")
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x02)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$380, DW_AT_name("rsvd1")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$380, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$380, DW_AT_bit_size(0x01)
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$381, DW_AT_name("rsvd2")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$381, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$381, DW_AT_bit_size(0x01)
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$382, DW_AT_name("AIO2")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_AIO2")
	.dwattr $C$DW$382, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$382, DW_AT_bit_size(0x01)
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$383, DW_AT_name("rsvd3")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$383, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$383, DW_AT_bit_size(0x01)
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$384, DW_AT_name("AIO4")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_AIO4")
	.dwattr $C$DW$384, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$384, DW_AT_bit_size(0x01)
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$385, DW_AT_name("rsvd4")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$385, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$385, DW_AT_bit_size(0x01)
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$386, DW_AT_name("AIO6")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_AIO6")
	.dwattr $C$DW$386, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$386, DW_AT_bit_size(0x01)
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$387, DW_AT_name("rsvd5")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd5")
	.dwattr $C$DW$387, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$387, DW_AT_bit_size(0x01)
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$388, DW_AT_name("rsvd6")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd6")
